app/Controllers/IndexController.php

    public function index()
    {
        session();

        if (!session()->has('initiated')) {
            session()->regenerate();
            session()->set('initiated', true);
        }

        $indexModel = new IndexModel();
        $data['denemeler'] = $indexModel->orderBy('tarih', 'DESC')->findAll();
---
SELECT *
FROM `denemeler`
ORDER BY `tarih` DESC